#!/bin/bash
# Скрипт для керування середовищем розробки

echo "🚀 Запуск локальних Docker контейнерів у фоні..."
docker compose up -d

# Функція для автоматичної очистки
cleanup() {
    echo ""
    echo "🛑 Завершення сесії програмування."
    echo "🧹 Зупинка та очищення Docker контейнерів..."
    docker compose down
    echo "✅ Готово!"
}

# Перехоплюємо завершення процесу (Ctrl+C (INT), стандартне закриття (EXIT), або примусове (TERM))
trap cleanup EXIT INT TERM

echo "✨ Запуск Vite сервера..."
# Запускаємо локальний фронтенд сервер віт
npx vite
